[PAD]
[BOS]
[EOS]
!
"
#
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
¸
½
¿
á
ï
Ċ
Ġ
Ĭ
Į
Ġ}
Ġ{
Ġ\
Ġ_
Ġ^
Ġ)
Ġ(
Ġ1
ma
Ġ2
Ġ,
th
ra
Ġ=
math
Ġ-
Ġ0
ar
Ġi
Ġ+
ta
ig
le
Ġn
me
in
Ġt
Ġr
al
fra
frac
Ġx
rm
mathrm
Ġ.
Ġa
Ġe
Ġk
Ġd
ft
ray
array
Ġs
Ġm
ime
igh
ight
right
ph
Ġl
eta
am
Ġp
left
Ġ|
pr
de
Ġc
Ġj
Ġ3
mathb
cal
Ġ\,
si
Ġ&
prime
Ġ/
Ġf
ot
ti
mathcal
Ġu
ĠT
Ġ4
da
dot
pha
nd
eg
lta
beg
end
begin
Ġy
psi
alpha
lo
ĠN
ĠA
ĠR
Ġh
Ġo
Ġb
Ġv
Ġg
Ġz
bda
ambda
ng
ĠS
ĠM
ĠL
mathbf
to
amma
Ġ~
igma
su
mu
ngle
ga
mega
Ġq
Ġ]
ĠP
ĠC
ĠB
phi
Ġ[
ĠE
pi
ĠH
lambda
lon
ve
rt
sigma
at
sum
hat
psilon
ĠX
mathbb
epsilon
lde
tilde
ĠF
theta
ĠD
na
ĠV
ho
bo
la
bol
rho
beta
Ġ5
gamma
op
var
delta
par
ĠI
ĠG
Ġw
Ġ*
tial
partial
bar
tau
omega
imes
bf
Ġ\}
qu
cdot
sq
ĠK
sqrt
nu
rangle
Ġ:
ope
rna
rato
operato
rname
operatorname
De
Delta
Ġ6
ap
ge
ll
leq
int
ow
Ġ\{
hi
Ġ\\
row
big
ex
ĠQ
times
inft
infty
ĠU
Ġ\;
arrow
Ġ\|
dots
Ġ8
ĠW
ĠZ
ad
quad
ell
langle
Ġ<
xi
ĠJ
sy
sym
bold
symbol
boldsymbol
rl
ine
rline
Omega
Ġ7
ĠY
Ġ\!
rightarrow
Gamma
vec
ĠO
ove
varepsilon
wi
wide
se
tex
set
Ġ;
pm
Ġ9
text
st
pa
overline
varphi
\{
co
sim
log
Ġ>
chi
ldots
kap
kappa
Phi
pro
Lambda
geq
Big
bla
nabla
iv
equ
equiv
maths
Sigma
cos
dag
widetilde
sin
up
mathfra
mathfrak
zeta
otimes
eq
sub
vert
cdots
subset
Psi
cr
us
cup
prox
approx
exp
rc
ger
dagger
cap
widehat
qquad
ci
circ
ln
mathsf
Ġ?
textrm
pt
\|
yle
style
ast
textbf
un
unde
er
bigg
sime
simeq
\}
Th
Theta
hbar
Ve
Vert
prod
ck
Pi
neq
per
perp
min
minus
setminus
mi
Ġ!
mid
ipt
scr
script
star
di
mathscr
or
fo
ce
underline
rall
forall
lus
oplus
ed
subseteq
wed
wedge
sla
lle
top
prop
propto
Ġ\:
odot
sp
ystyle
laystyle
disp
displaystyle
bra
flo
floor
tt
map
sto
mapsto
tr
re
brace
nt
sh
slant
colon
it
ss
less
bin
om
binom
sta
stack
own
parrow
bigl
lesssim
down
uparrow
bigr
not
long
downarrow
angle
cong
scriptstyle
sf
vartheta
rset
iangle
triangle
rel
il
leftarrow
longrightarrow
em
pty
empty
emptyset
bu
llet
bullet
vee
ralle
paralle
parallel
stackrel
leqslant
mathit
scriptscriptstyle
bigcup
ota
iota
rbrace
Bigg
Xi
lfloor
varrho
Ġ\#
rfloor
tan
textup
mp
nto
phanto
phantom
mal
he
nor
normal
pmb
slash
Ġ'
gg
textnormal
ack
back
backslash
cosh
mathtt
dim
che
check
tin
tiny
Bigl
sinh
lvert
Ġ\%
Bigr
tit
textit
ts
overset
ne
underset
Ġ\_
Upsilon
Right
Rightarrow
biggl
gets
lbrace
triangleq
eil
rceil
texttt
mathop
lce
lceil
leftrightarrow
textstyle
rvert
ddot
xrightarrow
biggr
ze
size
mo
notin
over
ec
prec
bot
lVert
thin
rVert
arp
ist
exist
exists
spa
space
geqslant
arg
gtr
scriptsize
varpi
sma
deg
gtrsim
overrightarrow
sup
supset
textsf
neg
upsilon
bigoplus
bre
substack
Re
underbrace
Ġ--
cc
small
sharp
succ
bigcap
mod
thinspace
vdots
sqcup
krightarrow
okrightarrow
hookrightarrow
land
imath
brack
arc
ker
varsigma
á¸
oint
Ġá¸
li
dash
dotsc
breve
ls
dels
models
Le
Left
Im
box
no
Leftrightarrow
rin
mathrin
mathring
preceq
vdash
Lo
Long
cot
arctan
varno
thing
varnothing
inter
intercal
en
es
imp
lies
implies
lbrack
od
pmod
bigwedge
varkappa
oo
arpoo
ner
ond
amond
diamond
cu
vphantom
Biggl
doteq
mathrel
rtimes
enspace
ni
fl
flat
supseteq
Ġá¸Į
Ġá¸Ĭ
wp
lor
\#
ak
break
ff
iff
bmod
Longrightarrow
bigotimes
iint
boxtimes
mathor
mathord
jmath
atop
succeq
coth
Biggr
asym
asymp
smash
bigvee
wbreak
allo
allowbreak
Ġ\&
rbrack
smallsetminus
otnot
footnot
footnote
footnotesize
arpoon
mathbin
ddots
longmapsto
bigtriangle
dle
middle
arge
te
acu
acute
Ġ"
cfrac
mathin
mathinner
lg
triangleright
AA
subsetneq
overleftarrow
uph
arpoonright
upharpoonright
Longleftrightarrow
tw
arcsin
coprod
triangleleft
rner
corner
ale
aleph
ominus
Bb
bk
Bbbk
ohe
adrightarrow
twohe
twoheadrightarrow
dotsb
bigsqcup
Ġ@
ltimes
\!
righ
tharpoo
rightharpoo
nup
rightharpoonup
bigtriangleup
lim
jlim
mathc
sqsubseteq
lax
relax
boxed
nat
ura
natura
natural
negthinspace
div
md
textmd
Large
\,
longleftrightarrow
lnot
ru
mathope
mathopen
uplus
hphantom
squ
igarrow
rightsqu
rightsquigarrow
circle
Ġ`
varGamma
sec
longleftarrow
yeq
rlyeq
curlyeq
searrow
plus
boxplus
mathnormal
rcorner
suit
lap
overbrace
varPhi
ddagger
Ġ\=
large
eth
Ġ\'
Vdash
widecheck
hom
dast
circledast
ou
pou
nds
stru
pounds
strut
mathstrut
sqcap
overleftrightarrow
lose
mathclose
Da
vDa
vDash
wr
dotsm
varpro
varprojlim
rlap
varDelta
amal
amalg
bigtriangledown
hslash
Ġ---
sc
csc
triangledown
preccurlyeq
varOmega
limi
with
operatornamewith
limits
operatornamewithlimits
frow
frown
xleftarrow
nearrow
sk
ip
skip
intop
enskip
wti
bowti
bowtie
rightrightarrow
rightrightarrows
lrcorner
rd
surd
Down
under
Downarrow
injlim
varinjlim
Uparrow
nmid
varLambda
ice
hoice
mathchoice
Ġ\.
rve
arrowright
curve
curvearrowright
fth
lefth
rightlefth
arpoons
rightleftharpoons
nobreak
diamondsuit
Ġ\^
\%
bigcirc
\;
ub
varSigma
det
cdotp
underbar
varPsi
rb
verb
dig
digamma
dashv
gra
grave
ct
pun
mathpun
mathpunct
nsubseteq
ddag
lessdot
for
lessapprox
sure
asure
measure
dangle
measuredangle
llcorner
vartriangle
Leftarrow
Sub
Subset
leme
comp
lement
complement
trianglelefteq
sqsubset
bigm
gtrless
--
ldot
ldotp
rightleftarrow
rightleftarrows
urcorner
rule
ch
succsim
Pr
lcorner
ulcorner
coloneq
varTheta
vartriangleleft
normalsize
tsuit
artsuit
heartsuit
Ġ\"
oslash
varPi
tail
rightarrowtail
vartriangleright
ick
thick
negthick
negthickspace
iiint
lti
multi
multimap
aa
mho
max
Jo
Join
succcurlyeq
bigstar
supsetneq
leqq
rq
lessgtr
tch
pitch
fork
pitchfork
textcircle
textcircled
smi
smile
precsim
AR
GE
LAR
LARGE
Ġpt
Ġmm
updownarrow
be
een
tween
between
med
negmed
negmedspace
line
wline
newline
biguplus
bigodot
dotso
nexists
gt
pprox
rapprox
gtrapprox
leftrightarrows
beth
rk
mark
checkmark
nsim
nrightarrow
Bigm
llap
boxdot
underrightarrow
efor
ther
efore
therefore
Ta
Tau
black
blacktriangleright
nleq
Ġ\`
Ġex
cl
ubsuit
clubsuit
fbox
char
---
\:
boldmath
Beta
ect
bj
bject
Ġem
\_
\=
ber
mber
number
nonumber
Ġcm
Ġ\)
Ġ\(
\^
oup
roup
ĠObject
object
á¸Ĭ
nda
fter
expa
ndafter
expandafter
\&
group
bgroup
egroup
á¸Į
mit
Ġ#
sb
Ġin
\'
\.
prot
protect
Ġ\/
Ġ\]
\`
fi
fill
hfill
sl
Vec
ref
ebox
kebox
vce
makebox
nter
vcenter
SS
Ġ\-
¿½
ï¿½
Ġï¿½
null
cd
gcd
Ġ\*
bump
bumpeq
Ti
eqno
Tilde
medskip
rgroup
uge
vline
ndown
Longleftarrow
lgroup
rightharpoondown
Huge
do
ew
hss
hspace
llde
nota
nleftrightarrow
ter
ule
vrule
Ġ\[
inde
lefteq
barwedge
nullde
textsl
biggm
Biggm
smallint
smallskip
kern
ensure
limiter
skew
notag
lefteqn
nulldelimiter
ensuremath
nulldelimiterspace
Bar
Rrightarrow
\"
\-
fil
gime
huge
hfil
nVdash
delim
dotsi
varUpsilon
varli
varlim
approxeq
cite
minf
backsimeq
noinde
atopwith
index
gimel
delims
varliminf
varlimsup
noindent
atopwithdelims